{"user": 0, "105": 1, "backends": 2, "toml": 3, "07": 4, "cpu": 5, "typescript": 6, "retrieve": 7, "texts": 8, "normalize_embeddings": 9, "limit": 10, "sub": 11, "cur_size": 12, "moon": 13, "ast": 14, "end": 15, "meta": 16, "dir": 17, "sync": 18, "13b": 19, "bool": 20, "cd": 21, "false": 22, "instruct": 23, "110": 24, "deepseek": 25, "expanduser": 26, "__dict__": 27, "found": 28, "start_line_no": 29, "jsonl": 30, "embeddings": 31, "py": 32, "9": 33, "retriever": 34, "dr": 35, "wxg": 36, "lambda": 37, "parse_args": 38, "embedding": 39, "lru_cache": 40, "ident": 41, "3": 42, "context": 43, "2560": 44, "2025": 45, "ensure_ascii": 46, "html": 47, "com": 48, "cache": 49, "sorted": 50, "scripts": 51, "sentence_transformers": 52, "less": 53, "txt": 54, "_ident": 55, "loads": 56, "paths": 57, "save": 58, "2_000_000": 59, "start": 60, "class": 61, "vue": 62, "yaml": 63, "open": 64, "20": 65, "70b": 66, "astchunk": 67, "mo": 68, "api": 69, "device": 70, "max_tokens": 71, "moe": 72, "encode": 73, "3gb": 74, "question": 75, "languages": 76, "8080": 77, "bm25s": 78, "117": 79, "rglob": 80, "mac": 81, "coder": 82, "embed": 83, "findall": 84, "node_modules": 85, "deep": 86, "ide": 87, "download": 88, "show_progress_bar": 89, "metadata": 90, "30b": 91, "jsx": 92, "80gb": 93, "hits": 94, "arxiv": 95, "b_size": 96, "corpus_tokens": 97, "7b": 98, "m4": 99, "print": 100, "transformer": 101, "dropout": 102, "table": 103, "try": 104, "kv": 105, "2024": 106, "max_chunk_size": 107, "path": 108, "error": 109, "index": 110, "0": 111, "13": 112, "strip": 113, "case": 114, "4bit": 115, "44": 116, "read": 117, "completions": 118, "vscode": 119, "silicon": 120, "256": 121, "32": 122, "from": 123, "bit": 124, "add": 125, "app": 126, "537": 127, "iter_files": 128, "client": 129, "tokenize": 130, "resolve": 131, "final": 132, "collect_chunks": 133, "open_table": 134, "corpus": 135, "tolist": 136, "ai": 137, "else": 138, "q4": 139, "messages": 140, "apache": 141, "to": 142, "learns": 143, "vector": 144, "s": 145, "add_parser": 146, "70": 147, "build_index": 148, "dumps": 149, "get": 150, "pathlib": 151, "overwrite": 152, "max_file_bytes": 153, "batch": 154, "build": 155, "bar": 156, "js": 157, "sentencetransformer": 158, "if": 159, "prog": 160, "ask": 161, "ascii": 162, "indexing": 163, "humaneval": 164, "create": 165, "mlx_lm": 166, "9_": 167, "node": 168, "sum": 169, "maxsize": 170, "base_url": 171, "eval": 172, "base": 173, "blocks": 174, "isspace": 175, "2506": 176, "message": 177, "qlora": 178, "server": 179, "size": 180, "5gb": 181, "none": 182, "m": 183, "04905": 184, "ok": 185, "p": 186, "exists": 187, "extend": 188, "re": 189, "27": 190, "81": 191, "vectors": 192, "b": 193, "top_n": 194, "compile": 195, "64": 196, "embed_documents": 197, "hr": 198, "_score": 199, "ml": 200, "source": 201, "apiconnectionerror": 202, "32b": 203, "macbook": 204, "ch": 205, "8gb": 206, "bytes": 207, "snake": 208, "search": 209, "http": 210, "lora": 211, "tuple": 212, "lance": 213, "bm25": 214, "hpp": 215, "serve": 216, "src": 217, "macos": 218, "5b": 219, "x": 220, "al": 221, "w": 222, "vs": 223, "2510": 224, "pod": 225, "prompt_name": 226, "sys": 227, "exception": 228, "extensions": 229, "cline": 230, "batch_size": 231, "24": 232, "create_table": 233, "splitlines": 234, "dirs": 235, "start_line": 236, "true": 237, "items": 238, "rtx": 239, "filenotfounderror": 240, "sql": 241, "runpod": 242, "kt": 243, "piece": 244, "dist": 245, "v1": 246, "swift": 247, "parents": 248, "human": 249, "load": 250, "lower": 251, "4gb": 252, "81gb": 253, "rb": 254, "seek": 255, "elif": 256, "1": 257, "id": 258, "text_extensions": 259, "append": 260, "config": 261, "46": 262, "nargs": 263, "iter": 264, "cpp": 265, "forgets": 266, "openai": 267, "76": 268, "exist_ok": 269, "utf": 270, "q4_k_m": 271, "ref": 272, "embed_query": 273, "racg": 274, "project_root": 275, "a3b": 276, "8k": 277, "text": 278, "cmu": 279, "tmlr": 280, "based": 281, "mrl": 282, "10": 283, "split": 284, "80": 285, "community": 286, "astchunkbuilder": 287, "bm25_top_k": 288, "bin": 289, "recall": 290, "files": 291, "for": 292, "args": 293, "pass": 294, "end_line_no": 295, "md": 296, "unicodedecodeerror": 297, "05": 298, "_chunk_text": 299, "corpus_dir": 300, "huggingface": 301, "css": 302, "qwen3": 303, "m5": 304, "best": 305, "a100": 306, "500": 307, "add_subparsers": 308, "role": 309, "hf": 310, "i": 311, "rank": 312, "prompt": 313, "chunking": 314, "4b": 315, "progress": 316, "__main__": 317, "st_size": 318, "and": 319, "stat": 320, "60": 321, "reciprocal": 322, "return": 323, "_chunk_code": 324, "apple": 325, "in": 326, "yml": 327, "index_dir": 328, "name": 329, "python": 330, "seg": 331, "sentence": 332, "36gb": 333, "gguf": 334, "dict": 335, "nws": 336, "__name__": 337, "tree": 338, "reranker": 339, "sysctl": 340, "41": 341, "cs": 342, "uv": 343, "astral": 344, "6b": 345, "exit": 346, "4f": 347, "camelcase": 348, "or": 349, "event": 350, "argument": 351, "p_search": 352, "e": 353, "embs": 354, "https": 355, "str": 356, "required": 357, "gb": 358, "ids": 359, "4090": 360, "sitter": 361, "rst": 362, "code": 363, "model": 364, "subparsers": 365, "z": 366, "256k": 367, "bleu": 368, "is_available": 369, "75": 370, "json": 371, "rrf": 372, "mkdir": 373, "max": 374, "c_sharp": 375, "os": 376, "qwenrag": 377, "2048": 378, "pycache": 379, "qwen2": 380, "github": 381, "chunkify": 382, "2026": 383, "v": 384, "st": 385, "8": 386, "main": 387, "top": 388, "description": 389, "2gb": 390, "final_top_n": 391, "53": 392, "sharp": 393, "project": 394, "docs": 395, "help": 396, "spot": 397, "resp": 398, "raw": 399, "idx": 400, "mode": 401, "gpu": 402, "language": 403, "write": 404, "fim": 405, "a": 406, "87": 407, "chunk_file": 408, "dataclasses": 409, "raise": 410, "property": 411, "db": 412, "continued": 413, "17": 414, "34": 415, "em": 416, "9gb": 417, "18": 418, "end_line": 419, "vector_top_k": 420, "encoding": 421, "functools": 422, "42": 423, "available": 424, "connection": 425, "skip_dirs": 426, "embedding_model": 427, "normalize": 428, "unicode": 429, "zed": 430, "go": 431, "camel": 432, "yield": 433, "000": 434, "is_file": 435, "_scores": 436, "17gb": 437, "min": 438, "system_prompt": 439, "z0": 440, "venv": 441, "n": 442, "idea": 443, "fusion": 444, "fse": 445, "cast": 446, "et": 447, "suffix": 448, "run": 449, "documents": 450, "data": 451, "show": 452, "h": 453, "exist": 454, "_builders": 455, "36": 456, "with": 457, "a3": 458, "delta": 459, "dataclass": 460, "api_key": 461, "16": 462, "git": 463, "za": 464, "ranks": 465, "ra": 466, "pretraining": 467, "systemexit": 468, "19": 469, "91": 470, "__file__": 471, "67": 472, "14": 473, "as": 474, "40k": 475, "template": 476, "decode": 477, "k": 478, "lancedb": 479, "chat": 480, "chunk": 481, "4096": 482, "rrf_k": 483, "local": 484, "mps": 485, "stream": 486, "r1": 487, "lines": 488, "zsh": 489, "67gb": 490, "lo": 491, "transformers": 492, "113": 493, "dev": 494, "command": 495, "java": 496, "relative_to": 497, "pro": 498, "argumentparser": 499, "chat_base_url": 500, "mlx": 501, "len": 502, "torch": 503, "explore": 504, "79": 505, "content": 506, "_": 507, "key": 508, "is": 509, "6gb": 510, "biderman": 511, "parts": 512, "_context": 513, "scores": 514, "startswith": 515, "tokens": 516, "book": 517, "builder": 518, "parse": 519, "ts": 520, "modules": 521, "show_progress": 522, "query": 523, "join": 524, "any": 525, "oserror": 526, "30": 527, "f": 528, "tsx": 529, "choices": 530, "_builder": 531, "tl": 532, "token": 533, "7": 534, "lm": 535, "ast_languages": 536, "set": 537, "int": 538, "p_index": 539, "system": 540, "skip": 541, "dest": 542, "builders": 543, "_camel": 544, "list": 545, "chunks": 546, "enumerate": 547, "stdout": 548, "tok": 549, "continue": 550, "1600": 551, "localhost": 552, "port": 553, "line": 554, "ensure": 555, "rs": 556, "to_list": 557, "sh": 558, "self": 559, "2505": 560, "not": 561, "float": 562, "6": 563, "argparse": 564, "relative": 565, "part": 566, "collect": 567, "snake_case": 568, "q_tokens": 569, "3b": 570, "2": 571, "refs": 572, "no": 573, "4": 574, "metadata_template": 575, "hit": 576, "retrieval": 577, "def": 578, "file": 579, "root": 580, "default": 581, "except": 582, "rag": 583, "5": 584, "flush": 585, "connect": 586, "46gb": 587, "exec": 588, "_load_chunks": 589, "qwen": 590, "15179": 591, "68": 592, "is_dir": 593, "read_text": 594, "p_ask": 595, "q": 596, "add_argument": 597, "lru": 598, "27gb": 599, "dirname": 600, "import": 601, "15655": 602, "__pycache__": 603, "parser": 604, "url": 605, "c": 606, "chat_model": 607, "cur": 608, "r": 609, "co": 610, "score": 611, "_model": 612, "": 613}